/* Задача 10: Напишите программу, которая принимает на вход трёхзначное число

 и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 */

/* 
Console.Clear();

Console.WriteLine("Введите трехзначное число:  ");

string input = Console.ReadLine();

int num = int.Parse(input);

if((num < 1000) & (num > 99))
{

    num = ((num / 10) % 10);

        Console.WriteLine(num);
}

else
   {

Console.WriteLine("Число не трехзначное");


   }
 */
    
/* 
Задача 13: Напишите программу, которая выводит третью цифру
 заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6
 */




